Revit 2027 API
FabricWireItem.Create Method
 Creates a new instance of a single Fabric wire.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FabricWireItem Create(
	double distance,
	double wireLength,
	ElementId wireType,
	double wireOffset
)
Public Shared Function Create (
	distance As Double,
	wireLength As Double,
	wireType As ElementId,
	wireOffset As Double
) As FabricWireItem
public:
static FabricWireItem^ Create(
	double distance,
	double wireLength,
	ElementId^ wireType,
	double wireOffset
)
static member Create :
        distance : float *
        wireLength : float *
        wireType : ElementId *
        wireOffset : float -> FabricWireItem
Parameters
distance Double
 The distance between this wire and the next wire in the Custom Fabric Sheet
wireLength Double
 Length of this wire
wireType ElementId
 The wire type of this wire
wireOffset Double
 The offset between two wires in the same line
Return Value
FabricWireItem
 The newly created Fabric wire instance.
Exceptions
Exception | Condition
ArgumentException |  The given value for distance is not a number -or- The given value for wireLength is not a number -or- wireType is not a valid Element identifier. -or- The given value for wireOffset is not a number
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for distance must be between 0 and 30000 feet. -or- The given value for wireLength must be greater than 0 and no more than 30000 feet. -or- The given value for wireOffset must be between 0 and 30000 feet.
See Also
Reference
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace